[
  {
    "file": "experiments/molnar-v1.js",
    "name": "Sleepy Eyes - Molnar Recreation V.1",
    "description": "Inspired by Vera Molnar, this piece captures the soft, dark blur of eyelids drifting shut. Starting from Garrit's code, I experimented with values and replaced sharp lines with smooth curves."
  },

  {
    "file": "experiments/molnar-v2.js",
    "name": "All Eyes On Me - Molnar Recreation V.2",
    "description": "Inspired by Vera Molnar, this piece captures the sensation of countless eyes watching, with randomized colors swirling like a crowd of gazes fixed on me. I built upon Garrit's code again, implementing a function for the colour randomisation."
  },

  {
    "file": "experiments/noise-landscape-v1.js",
    "name": "Hearbeat - Recreation of Noise Landscape - V.1",
    "description": "A red, moving noise-landscape built on Garrit's code, where racing lines pulse like the heart's always-high tempo."
  },

  {
    "file": "experiments/noise-landscape-v1.1.js",
    "name": "Rising Hearbeat - Recreation of Noise Landscape V.1.1",
    "description": "A rougher, more chaotic version of Heartbeat, where jagged lines represent the anxious feeling of the body"
  },

  {
    "file": "experiments/noise-landscape-v2.js",
    "name": "Dunes - Recreation of Noise Landscape V.2",
    "description": "Slow, flowing lines and fading sandy tones recreate the gentle, shifting motion of desert dunes, built from Garrit's original code. Here I made the speed of the line much slower, and their size smaller."
  },

  {
    "file": "experiments/particles-v1.js",
    "name": "Interesections - Particle Explosion V.1",
    "description": "An experiment using the particle code as a starting point where I created hollow circles with randomized stroke weights each time the mouse clicks. I played around with the values, and thanks to setting higher velocity there is a feeling of moving when the circles are created."
  },

  {
    "file": "experiments/particles-v2.js",
    "name": "Aura - Particle Explosion V.2",
    "description": "A variation of Particle Explosion where smaller circles appear with two colors upon mouse click. When the circles intersect, their overlapping area turns white, creating a glowing effect."
  },

  {
    "file": "experiments/particles-v3.js",
    "name": "Aura Windows - Particle Explosion V.3",
    "description": "A variation of Particle Explosion where rectangles with no fill, only strokes, are created with each mouse click. The rectangles form a window-like effect, with the intersection area glowing white when they overlap."
  },

  {
    "file": "experiments/sound.js",
    "name": "Icicles Sound",
    "description": "A variation of Particle Explosion where line-like shards burst out with each mouse click, creating a dynamic visual effect. Each explosion is paired with a random musical note, combining custom particle code with techniques from the Tone.js documentation."
  }
]
